## SQL and SQL Lite
SQL (Structured Query Language) is a standard language for managing and manipulating relational databases.SQL is a self-contained,serverless, and zero-configuration database engine that is widely used for embedded database systems. In this Lesson we will cover the basics of SQL and SQLite, including creating databases, tables and performing various SQL Operations/

In [4]:
import sqlite3

In [5]:
## connect to an sqlite database
connection = sqlite3.connect('example.db')
connection

In [6]:
## create a cursor object
cursor=connection.cursor()

In [ ]:
## create a table
cursor.execute(''' 
Create Table if Not Exists employess(
               id Integer Primary Key,
               name Tet Not Null,
               age Integer,
               department text
               )
''')
## commit the changes 
connection.commit()

In [10]:
cursor.execute(''' 
Select * from employess
''')

In [19]:
## insert the data in sqlite table
cursor.execute('''
Insert into employess(name, age, department)
               values("Ali", 20, "Data Scientist")
               ''')
cursor.execute('''
INSERT INTO EMPLOYESS(name, age, department)
VALUES("John Wallack", 32, "Finance")
               ''')
cursor.execute('''
INSERT INTO EMPLOYESS(name,age,department)
VALUES("Bruce Wayne", 30, "Sales")
''')
## commit the changes
connection.commit()

In [20]:
cursor.execute("Select * from employess")
rows = cursor.fetchall()
## print  the queried data
for row in rows:
    print(row)

(1, 'Ali', 20, 'Data Scientist')
(2, 'John Wallack', 32, 'Finance')
(3, 'Ali', 20, 'Data Scientist')
(4, 'John Wallack', 32, 'Finance')
(5, 'Ali', 20, 'Data Scientist')
(6, 'John Wallack', 32, 'Finance')
(7, 'Ali', 20, 'Data Scientist')
(8, 'John Wallack', 32, 'Finance')
(9, 'Bruce Wayne', 30, 'Sales')

In [21]:
## update the data in the table
cursor.execute('''
UPDATE employess
Set age = 34
where name = "Ali"
''')

In [22]:
cursor.execute("Select * from employess")
rows = cursor.fetchall()
## print  the queried data
for row in rows:
    print(row)

(1, 'Ali', 34, 'Data Scientist')
(2, 'John Wallack', 32, 'Finance')
(3, 'Ali', 34, 'Data Scientist')
(4, 'John Wallack', 32, 'Finance')
(5, 'Ali', 34, 'Data Scientist')
(6, 'John Wallack', 32, 'Finance')
(7, 'Ali', 34, 'Data Scientist')
(8, 'John Wallack', 32, 'Finance')
(9, 'Bruce Wayne', 30, 'Sales')

In [23]:
## delete the data from the table
cursor.execute('''
Delete from employess
               where name = "Bruce Wayne"               
''')

In [24]:
cursor.execute("select * from employess")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Ali', 34, 'Data Scientist')
(2, 'John Wallack', 32, 'Finance')
(3, 'Ali', 34, 'Data Scientist')
(4, 'John Wallack', 32, 'Finance')
(5, 'Ali', 34, 'Data Scientist')
(6, 'John Wallack', 32, 'Finance')
(7, 'Ali', 34, 'Data Scientist')
(8, 'John Wallack', 32, 'Finance')

In [28]:
### Working with sales data
connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()
## creating a table for sales data
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales(
               id INTEGER PRIMARY KEY,
               date TEXT NOT NULL,
               product TEXT NOT NULL,
               sales INTEGER,
               region TEXT
            )
    ''')
## insert data into the sales table
sales_data = [
    ('2023-01-01', "Product-1", 100, 'North'),
    ('2023-01-02', "Product-2", 200, 'East'),
    ('2023-01-03', "Product-3", 340, 'West'),
    ('2023-01-04', "Product-4", 890, 'South')
]
connection.commit()
## by bulk insertion
cursor.executemany('''
Insert into sales(date, product,Sales, Region)
                   values(?,?,?,?)
                   ''', sales_data)
connection.commit()

In [31]:
cursor.execute("select * from sales")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, '2023-01-01', 'Product-1', 100, 'North')
(2, '2023-01-02', 'Product-2', 200, 'East')
(3, '2023-01-03', 'Product-3', 340, 'West')
(4, '2023-01-04', 'Product-4', 890, 'South')

In [32]:
connection.close()

In [33]:
cursor.connection()

ProgrammingError: Cannot operate on a closed database.